#int() არის ფუნქცია რომელიც ტექსტის ან ათწილადი რიცხვის მთელ რიცხვად გადაქცევისთვის გამოიყენება
#str() არის ფუნქცია რომელიც ნებისმიერი ტიპის მონაცემს სტრინგად (ტექსტურად) გადააქცევს
#type() არის ფუნქცია რომელიც აბრუნებს გადაცემული მონაცემის ტიპს. ის ხშირად გამოიყენება იმის გასარკვევად, თუ რა ტიპის მონაცემები გვაქვს, მაგალითად, მთელი რიცხვი, ათწილადი რიცხვი და სტრინგი
#input() არის ფუნქცია რომელიც საშუალებას აძლევს პროგრამას მიიღოს მონაცემები მომხმარებლისგან. ეს ფუნქცია ასევე ეკრანზე გამოიტანს შეტყობინებას და ელოდება რომ მომხმარებელმა შეიყვანოს კლავიატურით მონაცემები
