#page secition არის ვებსაიტზე რაიმე კონკრეტული რომელიც სტრუქტურულად გამოყოფილი
#heard გვერდის დასაწყისში შეიცავს ყველანაირ ინფორმაციას გვერდის შესახებ
#nav არის ტეგი რომელიც ძირითადად შეიცავს ღილაკებს და ლინკებს 
#main არის ტეგი რომელშიც მოთავსებულია საიტის ის იფორმაცია რომელიც მომხმარებელს აინტერესებს
#section რომელსაც ხშირად საიტის დაორგანიზებაში იყენებენ
#div გამოიყენება დიზაინის და სტრუქტურის შესაქმნელად
# footer იგი გამოიყენება კონტაქტის განთავსებისთვის რაც საიტების ბოლოშია მოცემული
#aside ეს არის ტეგი რომელიც გამოიყენება ისეთ დროს როცა რაღაც იმპორმაცცია მეორესთან არც თუ ისე ახლოა შინაარსით