#bug არის პროგრამული შეცდომა ან დეფექტი, რომელიც იწვევს პროგრამის არასწორ მუშაობას ან ხელს უშლი მის სწორად ფუნქციონირებას
#debugging არის პროცესების და მეთოდების ნაკრები, რომელიც გამოიყენება კოდში არსებული შეცდომების (ბაგების) პოვნასა და გამოსწორებაში
#რიცხვითი მნიშვნელობა არის მონაცემის ტიპი, რომელიც შეიცავს რიცხვს და გამოიყენება მათემატიკური გამოთვლებისთვის ან მონაცემთა გადაცემისთვის
#კომანტარები კოდსი უნდა გამოვიყენოთ რადგან ისინი აუმჯობესებენ კოდის გასაგებს და მენეჯმენტს.კომენტარები დეველოპერს ეხმარება კოდის დანიშნულების ან ფუნქციონირების უკეთ გაგებაში
