#კომენტარებით აღწერე ცვლადის შექმნის თითოეული ნაბიჯი(სულ 3)

#ცვლადის სრულყოფილად შესაქმნელად საჭიროა შემდეგი სამი ნაბიჯის შესრულება:

#1) ცვლადისთვის სახელის დარქმევა _ ცვლადი თავის თავში ინახავს მონაცემთა მნიშვნელობას. სახელის დარქმევით ჩვენ მასში მომავალში მოვაქცევთ კონკრეტულ მნიშვნელობას, კატეგორიას.
#2) დამაკავშირებელი სიმბოლოს გამოყენება _ დამაკავშირებელი სიმბოლო ' = ' (ტოლობის ნიშანი)წარმოადგენს პითონის ოპერატორს, რომელიც ცვლადს უკავშირებს მნიშვნელობას.
#3) ცვლადისთვის მნიშვნელობის მინიჭება _ მნიშვნელობის მინიჭებით ცვლადი ინახება მონაცემთა ბაზაში და მზადაა შემდგომი გამოყენებისთვის.

#მაგ:
# (1)car =(2) "BMW"(3)

#თუ print() ფუნქციას გადავცემთ car-ს, ტერმინალში გამოიტანს BMW-ს


car = "BMW"

print(car)